transient_rbf/Fluid/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          1e-2;
        smoother        DICGaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
        relTol          0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          1e-2;
        minIter         2;
    }

    "(U|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors                 2;
    nNonOrthogonalCorrectors    3;
    nOuterCorrectors            5;

    tolerance                   1.0e-14;
    relTol                      5e-3;
    pisoTol                     1e-6;

    consistent                  true;
    correctPhi                  true;
    momentumPredictor           true;

}

relaxationFactors
{

    fields
    {
        "p.*"                       0.3;
        "rho.*"                     0.1;
        "(.*)Final"                 0.95;
    }

    equations
    {
        "U.*"                       0.7;
        "e.*"                       0.1;
        "(k|epsilon|omega).*"       0.3;
        "(.*)Final"                 0.95;
    }

}

// ************************************************************************* //
