transient_rbf/Fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

preciceConfig   "../preCICE.xml";

participant     Fluid_Solver;

modules         (FSI);

interfaces
{

    Interface1
    {
        mesh              Fluid_CellCenters;

        patches           (bottomWall);
        locations         faceCenters;

        readData
        (
            Displacement
        );

        writeData
        (
            Stress
        );
    };

};

FSI
{
    rho     rho     [1 -3 0 0 0 0 0]    1.0;
    
     // The point displacement field is unused for the RBF mesh motion solver
    namePointDisplacement unused;

    // Specify the RBF cell motion field
    nameCellDisplacement rbfMotionCentersField;
}

// ************************************************************************* //
